Revit 2026 API

# CopyPasteOptionsGetDuplicateTypeNamesHandler Method

---

Returns current duplicate type names handler or  if none is set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IDuplicateTypeNamesHandler GetDuplicateTypeNamesHandler()
```
```vb
Public Function GetDuplicateTypeNamesHandler As IDuplicateTypeNamesHandler
```
```cpp
public:
IDuplicateTypeNamesHandler^ GetDuplicateTypeNamesHandler()
```
```fsharp
member GetDuplicateTypeNamesHandler : unit -> IDuplicateTypeNamesHandler
```

#### Return Value

IDuplicateTypeNamesHandler

#### Reference

CopyPasteOptions Class

Autodesk.Revit.DB Namespace